app/views/books/_index.html.erb

                <%= link_to book_favorites_path(book.id), method: :delete  do %>
                  ♥<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]

                <%= link_to book_favorites_path(book.id), method: :post do %>
                  ♡<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]