app/controllers/book_comments_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["book_id", 4], ["comment", "aaaaaaaaaaa"], ["created_at", "2022-07-18 14:42:25.371278"], ["updated_at", "2022-07-18 14:42:25.371278"]]
---
  def create

    book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(post_comment_params)
    comment.book_id = book.id
    comment.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
---
  def destroy
    book = Book.find(params[:book_id])
    book_comment = BookComment.find(params[:id])
    book_comment.destroy