app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @book_comments = BookComment.all
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments"

  def index
    #@books = Book.all
    @user = User.find(current_user.id)
    @books = Book.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    #binding.irb
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else

      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bb"], ["body", "cc"], ["user_id", 3], ["created_at", "2022-07-17 10:23:08.876149"], ["updated_at", "2022-07-17 10:23:08.876149"]]
SELECT "books".* FROM "books"