app/controllers/favorites_controller.rb

    def create
      book = Book.find(params[:book_id])
      favorite = current_user.favorites.new(book_id: book.id)

      if favorite.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["book_id", 4], ["created_at", "2022-07-17 14:36:35.419809"], ["updated_at", "2022-07-17 14:36:35.419809"]]