app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "33"], ["updated_at", "2022-07-17 07:26:36.742547"], ["id", 1]]